export default {
    mainHeader: {
        loading: "Завантаження...",
        login: "Увійти",
        logout: "Вийти",
        register: "Зареєструватися",
        nav: {
            home: "Домашня",
            transactions: "Транзакції",
            analytics: "Аналітика",
        },
    },

    mainFooter: {
        desc: "Це футер",
    },

    mainLoader: "Завантаження...",

    form: {
        required: "Обов'язкове",
        password_show: "Показати пароль",
        no_options_text: "Немає варіантів",
    },

    data: {
        dayOfWeek: {
            0: "Неділя",
            1: "Понеділок",
            2: "Вівторок",
            3: "Середа",
            4: "Четвер",
            5: "П'ятниця",
            6: "Субота",
        },
        month: {
            1: "Січень",
            2: "Лютий",
            3: "Березень",
            4: "Квітень",
            5: "Травень",
            6: "Червень",
            7: "Липень",
            8: "Серпень",
            9: "Вересень",
            10: "Жовтень",
            11: "Листопад",
            12: "Грудень",
        },
        currency: {
            AED: "Дирхам ОАЕ",
            AFN: "Афганський афгані",
            ALL: "Албанський лек",
            AMD: "Вірменський драм",
            ANG: "Нідерландський антильський гульден",
            AOA: "Ангольська кванза",
            ARS: "Аргентинський песо",
            AUD: "Австралійський долар",
            AWG: "Арубанський флорин",
            AZN: "Азербайджанський манат",
            BAM: "Боснійсько-герцоговинська конвертована марка",
            BBD: "Барбадоський долар",
            BDT: "Бангладеська така",
            BGN: "Болгарський лев",
            BHD: "Бахрейнський динар",
            BIF: "Бурундійський франк",
            BMD: "Бермудський долар",
            BND: "Брунейський долар",
            BOB: "Болівійський болівіано",
            BOV: "Болівійський мвдол",
            BRL: "Бразильський реал",
            BSD: "Багамський долар",
            BTN: "Бутанський нгултрум",
            BWP: "Ботсванська пула",
            BYN: "Білоруський рубль",
            BZD: "Белізький долар",
            CAD: "Канадський долар",
            CDF: "Конголезький франк",
            CHE: "WIR євро",
            CHF: "Швейцарський франк",
            CHW: "WIR франк",
            CLF: "Чилійський юнідадес де фоменто",
            CLP: "Чилійський песо",
            COP: "Колумбійський песо",
            COU: "Колумбійський юнідад де валор реал",
            CRC: "Костариканський колон",
            CUC: "Кубинський конвертований песо",
            CUP: "Кубинський песо",
            CVE: "Ескудо Кабо-Верде",
            CZK: "Чеська крона",
            DJF: "Джибутійський франк",
            DKK: "Датська крона",
            DOP: "Домініканський песо",
            DZD: "Алжирський динар",
            EGP: "Єгипетський фунт",
            ERN: "Еритрейська накфа",
            ETB: "Ефіопський бир",
            EUR: "Євро",
            FJD: "Долар Фіджі",
            FKP: "Фунт Фолклендських островів",
            GBP: "Фунт стерлінгів",
            GEL: "Грузинський ларі",
            GHS: "Ганський седі",
            GIP: "Гібралтарський фунт",
            GMD: "Гамбійський даласі",
            GNF: "Гвінейський франк",
            GTQ: "Гватемальський кетсаль",
            GYD: "Гаянський долар",
            HKD: "Гонконгський долар",
            HNL: "Гондураська лемпіра",
            HTG: "Гаїтянський гурд",
            HUF: "Угорський форинт",
            IDR: "Індонезійська рупія",
            ILS: "Ізраїльський новий шекель",
            INR: "Індійська рупія",
            IQD: "Іракський динар",
            IRR: "Іранський ріал",
            ISK: "Ісландська крона",
            JMD: "Ямайський долар",
            JOD: "Йорданський динар",
            JPY: "Японська єна",
            KES: "Кенійський шилінг",
            KGS: "Киргизький сом",
            KHR: "Камбоджійський рієль",
            KMF: "Коморський франк",
            KPW: "Північнокорейський вон",
            KRW: "Південнокорейський вон",
            KWD: "Кувейтський динар",
            KYD: "Долар Кайманових островів",
            KZT: "Казахстанський тенге",
            LAK: "Лаоський кіп",
            LBP: "Ліванський фунт",
            LKR: "Шрі-ланкійська рупія",
            LRD: "Ліберійський долар",
            LSL: "Лесотський лоті",
            LYD: "Лівійський динар",
            MAD: "Марокканський дирхам",
            MDL: "Молдовський лей",
            MGA: "Малагасійський аріарі",
            MKD: "Македонський денар",
            MMK: "М'янманський кьят",
            MNT: "Монгольський тугрик",
            MOP: "Патака Макао",
            MRU: "Мавританська угія",
            MUR: "Маврикійська рупія",
            MVR: "Мальдівська руфія",
            MWK: "Малавійська квача",
            MXN: "Мексиканський песо",
            MXV: "Мексиканський юнідад де інверсіон",
            MYR: "Малайзійський рингіт",
            MZN: "Мозамбіцький метикал",
            NAD: "Намібійський долар",
            NGN: "Нігерійська найра",
            NIO: "Нікарагуанська кордоба",
            NOK: "Норвезька крона",
            NPR: "Непальська рупія",
            NZD: "Новозеландський долар",
            OMR: "Оманський ріал",
            PAB: "Панамська бальбоа",
            PEN: "Перуанський соль",
            PGK: "Кіна Папуа-Нової Гвінеї",
            PHP: "Філіппінський песо",
            PKR: "Пакистанська рупія",
            PLN: "Польський злотий",
            PYG: "Парагвайський гуарані",
            QAR: "Катарський ріал",
            RON: "Румунський лей",
            RSD: "Сербський динар",
            CNY: "Китайський юань",
            RUB: "Російський рубль",
            RWF: "Руандійський франк",
            SAR: "Саудівський ріал",
            SBD: "Долар Соломонових островів",
            SCR: "Сейшельська рупія",
            SDG: "Суданський фунт",
            SEK: "Шведська крона",
            SGD: "Сінгапурський долар",
            SHP: "Фунт Святої Єлени",
            SLE: "Сьєрра-леонський леоне",
            SLL: "Сьєрра-леонський леоне",
            SOS: "Сомалійський шилінг",
            SRD: "Суринамський долар",
            SSP: "Південносуданський фунт",
            STN: "Добра Сан-Томе і Прінсіпі",
            SVC: "Сальвадорський колон",
            SYP: "Сирійський фунт",
            SZL: "Свазілендський лілангені",
            THB: "Таїландський бат",
            TJS: "Таджицький сомоні",
            TMT: "Туркменський манат",
            TND: "Туніський динар",
            TOP: "Паанга Тонга",
            TRY: "Турецька ліра",
            TTD: "Долар Тринідаду і Тобаго",
            TWD: "Новий тайванський долар",
            TZS: "Танзанійський шилінг",
            UAH: "Українська гривня",
            UGX: "Угандійський шилінг",
            USD: "Долар США",
            USN: "Долар США (наступного дня)",
            UYI: "Уругвайський песо в індексованих одиницях",
            UYU: "Уругвайський песо",
            UYW: "Уругвайський песо в індексованих одиницях",
            UZS: "Узбецький сум",
            VED: "Вєтнамський донг",
            VES: "Вєтнамський донг",
            VND: "В'єтнамський донг",
            VUV: "Вануатський вату",
            WST: "Самоанська тала",
            XAF: "Центральноафриканський франк",
            XCD: "Східнокарибський долар",
            XDR: "Спеціальні права запозичення",
            XOF: "Західноафриканський франк",
            XPF: "Французький тихоокеанський франк",
            XSU: "Сукре",
            XUA: "Рахунок АФР",
            YER: "Єменський ріал",
            ZAR: "Південноафриканський ранд",
            ZMW: "Замбійська квача",
            ZWL: "Зімбабвійський долар",

            // Ctypto

            BTC: "Bitcoin",
            ETH: "Ethereum",
            USDT: "Tether",
            BNB: "Binance Coin",
            XRP: "XRP",
            USDC: "USD Coin",
            DOGE: "Dogecoin",
            ADA: "Cardano",
            SOL: "Solana",
            TRX: "TRON",
        },
        transactionCategoryType: {
            income: "Дохід",
            outcome: "Витрата",
        },
        transactionCategory: {
            incomeName: "Дохід",
            outcomeName: "Витрата",
            deleted: "Видалена категорія",
            outcome: {
                food_and_beverages: "Їжа і напої",
                grocery: "Продукти",
                restaurant: "Ресторан",
                cafe: "Кафе",
                alcohol_and_bars: "Алкоголь і бари",
                snacks: "Закуски",

                transportation: "Транспорт",
                public_transportation: "Громадський транспорт",
                taxi: "Таксі",
                gas: "Паливо",
                parking: "Паркінг",
                car_warranty: "Гарантія на автомобіль",
                car_maintenance: "Обслуговування автомобіля",

                travel: "Подорожі",

                entertainment: "Розваги",
                movies: "Кіно",
                concerts: "Концерти",
                theater: "Театр",
                games: "Ігри",

                family: "Сім'я",
                partner: "Партнер",
                children: "Діти",
                parents: "Батьки",
                pets: "Домашні тварини",

                friends: "Друзі",

                hobby: "Хобі",

                sport: "Спорт",
                gym: "Спортзал",
                sport_equipment: "Спортивне обладнання",

                personal_care: "Особистий догляд",
                haircut: "Стрижка",
                beauty: "Краса",
                cosmetics: "Косметика",
                spa: "Спа",

                health: "Здоров'я",
                pharmacy: "Аптека",
                primary_care: "Первинна допомога",
                dental_care: "Стоматологія",
                specialty_care: "Спеціалізована допомога",
                surgery: "Хірургія",
                medical_devices: "Медичні прилади",

                education: "Освіта",
                books: "Книги",
                courses: "Курси",

                shopping: "Покупки",
                clothing: "Одяг",
                shoes: "Взуття",
                electronics: "Електроніка",
                accessories: "Аксесуари",
                home: "Дім",

                bills: "Рахунки",
                subscription: "Підписка",
                phone_bill: "Рахунок за телефон",
                internet_bill: "Рахунок за інтернет",
                television_bill: "Рахунок за телебачення",
                rent: "Оренда",
                water_bill: "Рахунок за воду",
                electricity_bill: "Рахунок за електрику",
                gas_bill: "Рахунок за газ",

                gift: "Подарунок",
                birthday: "День народження",
                charity: "Благодійність",

                business: "Бізнес",

                savings: "Заощадження",

                other: "Інше",
            },
            income: {
                salary: "Зарплата",
                gift: "Подарунок",
                award: "Нагорода",
                sponsorship: "Спонсорство",
                business: "Бізнес",
                other: "Інше",
            },
        },
    },

    fetchErrors: {
        fetchError: "Сервер недоступний. Будь ласка, спробуйте пізніше",
        serverError: "Серверна помилка. Будь ласка, спробуйте пізніше."
            + " Якщо проблема не зникне, зверніться до адміністратора",
        unknownError: "Невідома помилка. Будь ласка, спробуйте пізніше."
            + " Якщо проблема не зникне, зверніться до адміністратора",
    },

    // Error pages

    errorPage: {
        header: "Помилка",
        desc: "Щось пішло не так. Будь ласка, спробуйте пізніше. Якщо проблема не зникне,"
            + " зверніться до адміністратора.",
        link: "Перейти на домашню сторінку",
    },

    forbiddenPage: {
        header: "Заборонено",
        desc: "У вас немає дозволу на доступ до цієї сторінки.",
        link: "Перейти на домашню сторінку",
    },

    notFoundPage: {
        header: "Не знайдено",
        desc: "Сторінка, яку ви шукаєте, не існує.",
        link: "Перейти на домашню сторінку",
    },

    // Pages

    homePage: {
        title: "Домашня сторінка",
    },

    loginPage: {
        title: "Вхід",
        resendVerificationEmail: "Повторно надіслати листа з підтвердженням",
        appMessages: {
            account_confirmation_success: "Аккаунт успішно активовано. Тепер ви можете увійти.",

            validation_token_wrong_type: "Невірний тип токена.",
            validation_token_not_found: "Токен не знайдено. Будь ласка, спробуйте ще раз.",
            validation_token_used: "Токен вже був використаний.",
            validation_token_expired: "Час дії токену минув",

            validation_token_verification_not_found: "Токен підтвердження не знайдено."
                + " Будь ласка, спробуйте ще раз.",
            validation_token_verification_expired: "Токен підтвердження застарів.",
            validation_token_verification_user_enabled: "Аккаунт вже активовано."
                + " Ви можете увійти.",

            password_reset_success: "Пароль успішно оновлено. Тепер ви можете увійти.",
            auth_expired: "Термін дії сесії закінчився. Будь ласка, увійдіть знову.",
            auth_needed: "Будь ласка, увійдіть, щоб продовжити.",
        },
        form: {
            fields: {
                username: "Електронна пошта",
                password: "Пароль",
            },
            errors: {
                username: {
                    required: "Електронна пошта обов'язкова",
                },
                password: {
                    required: "Пароль обов'язковий",
                },
            },
            submit: "Увійти",
            forgotPassword: "Забули пароль?",
            loading: "Вхід...",
        },
    },

    registerPage: {
        title: "Реєстрація",
        appMessages: {
            registration_success: "Реєстрація успішна."
                + " Будь ласка, перевірте свою електронну пошту для підтвердження."
                + " Якщо ви не отримали листа, перевірте папку 'Спам'",
        },
        form: {
            fields: {
                email: "Електронна пошта",
                password: "Пароль",
                matchingPassword: "Підтвердження пароля",
            },
            errors: {
                email: {
                    required: "Електронна пошта обов'язкова",
                },
                password: {
                    required: "Пароль обов'язковий",
                },
                matchingPassword: {
                    required: "Підтвердження пароля обов'язкове",
                },
            },
            submit: "Зареєструватися",
            loading: "Реєстрація...",
        },
    },

    resendVerificationEmailPage: {
        title: "Повторно надіслати листа з підтвердженням",
        appMessages: {
            email_resend_success: "Листа з підтвердженням успішно надіслано."
                + " Будь ласка, перевірте свою електронну пошту."
                + " Якщо ви не отримали листа, перевірте папку 'Спам'",
        },
        form: {
            fields: {
                email: "Електронна пошта",
            },
            errors: {
                email: {
                    required: "Електронна пошта обов'язкова",
                },
            },
            submit: "Надіслати",
            loading: "Надсилання...",
        },
    },

    resetPasswordPage: {
        title: "Скидання пароля",
        appMessages: {
            reset_password_success: "Вам надіслано листа з посиланням для скидання пароля."
                + " Якщо лист не надійшов через декілька хвилин, перевірте папку 'Спам'",
        },
        form: {
            fields: {
                email: "Електронна пошта",
            },
            errors: {
                email: {
                    required: "Електронна пошта обов'язкова",
                },
            },
            submit: "Надіслати",
            loading: "Надсилання...",
        },
    },

    resetPasswordSetPage: {
        title: "Встановлення нового пароля",
        form: {
            fields: {
                newPassword: "Новий пароль",
                matchingPassword: "Підтвердження пароля",
            },
            errors: {
                newPassword: {
                    required: "Пароль обов'язковий",
                },
                matchingPassword: {
                    required: "Підтвердження пароля обов'язкове",
                },
            },
            submit: "Змінити пароль",
            loading: "Зміна пароля...",
        },
    },

    // Money

    transactionsPage: {
        appMessages: {
            wallet_create_success: "Гаманець успішно створено.",
            transaction_create_success: "Транзакція успішно створена.",
        },
        addNewTransaction: "Додати нову транзакцію",
    },

    walletBlock: {
        noWalletSelected: "Виберіть гаманець",
        loading: "Завантаження...",
        addNewWallet: "Додати новий гаманець",
        updateWalletName: "Змінити назву гаманця",
        changeWalletBalance: "Змінити баланс гаманця",
        deleteWallet: "Видалити гаманець",
    },

    dateBlock: {
        invalidDate: "Невірна дата",
        invalidDateError: "Будь ласка, виберіть дійсну дату для відображення транзакцій",
        nextDay: "Наступний день",
        prevDay: "Попередній день",
    },

    transactionBlock: {
        loading: "Завантаження...",
        failToLoadTransactions: "Не вдалося завантажити транзакції",
        noTransactions: "Немає транзакцій",
        noWallets: "Додайте гаманець щоб почати",
    },

    transactionElement: {
        menu: {
            delete: "Видалити",
            edit: "Редагувати",
        },
    },

    createWalletModal: {
        title: "Створити гаманець",
        form: {
            fields: {
                name: "Назва",
                balance: "Баланс",
                currency: "Валюта",
            },
            errors: {
                name: {
                    required: "Назва обов'язкова",
                },
                balance: {
                    required: "Баланс обов'язковий",
                },
                currency: {
                    required: "Валюта обов'язкова",
                },
            },
            loading: "Створення...",
            submit: "Створити",
        },
    },

    updateWalletNameModal: {
        title: "Редагувати назву гаманця",
        form: {
            fields: {
                name: "Назва",
            },
            errors: {
                name: {
                    required: "Назва обов'язкова",
                },
            },
        },
        loading: "Оновлення...",
        submit: "Оновити",
    },

    changeWalletBalanceModal: {
        title: "Змінити баланс гаманця",
        form: {
            fields: {
                balance: "Баланс",
            },
            errors: {
                balance: {
                    required: "Баланс обов'язковий",
                },
            },
        },
        transactionDescription: "Зміна балансу",
        submit: "Змінити",
        loading: "Оновлення...",
        error: "Не вдалося змінити баланс",
    },

    deleteWalletModal: {
        title: "Видалити гаманець?",
        checking: "Перевірка...",
        checkingError: "Не вдалося перевірити гаманець. Будь ласка, спробуйте пізніше",
        canDelete: "Гаманець порожній. Ви можете видалити його.",
        cannotDelete: "Гаманець має транзакції ({0}). Ви не можете видалити його.",
        loading: "Видалення...",
        fetchError: "Не вдалося з'єднатися з сервером. Будь ласка, спробуйте пізніше",
        buttons: {
            cancel: "Скасувати",
            confirm: "Видалити",
            goBack: "Повернутися",
        },
    },

    createTransactionModal: {
        title: "Створити транзакцію",
        form: {
            fields: {
                walletId: "Гаманець",
                categoryId: "Категорія",
                date: "Дата",
                amount: "Сума",
                description: "Опис",
            },
            errors: {
                walletId: {
                    required: "Гаманець обов'язковий",
                },
                categoryId: {
                    required: "Категорія обов'язкова",
                },
                date: {
                    required: "Дата обов'язкова",
                    min: "Дата має бути пізнішою за {0}",
                    max: "Дата має бути ранішою за {0}",
                },
                amount: {
                    required: "Сума обов'язкова",
                },
            },
            loading: "Створення...",
            submit: "Створити",
        },
    },

    updateTransactionModal: {
        title: "Редагувати транзакцію",
        description: "Ви можете вибрати гаманець тільки з такою ж валютою що й транзакція",
        form: {
            fields: {
                walletId: "Гаманець",
                categoryId: "Категорія",
                date: "Дата",
                amount: "Сума",
                description: "Опис",
            },
            errors: {
                walletId: {
                    required: "Гаманець обов'язковий",
                },
                categoryId: {
                    required: "Категорія обов'язкова",
                },
                date: {
                    required: "Дата обов'язкова",
                    min: "Дата має бути пізнішою за {0}",
                    max: "Дата має бути ранішою за {0}",
                },
                amount: {
                    required: "Сума обов'язкова",
                },
            },
            loading: "Оновлення...",
            submit: "Оновити",
        },
    },

    selectCategoryModal: {
        showMore: "Показати більше",
        showLess: "Показати менше",
    },

    deleteTransactionModal: {
        title: "Видалити транзакцію?",
        buttons: {
            cancel: "Скасувати",
            confirm: "Видалити",
        },
        loading: "Видалення...",
        fetchError: "Не вдалося з'єднатися з сервером. Будь ласка, спробуйте пізніше",
    },

    analyticsBlock: {
        showChildCategories: "Показати дочірні категорії",
        noDataForAnalytics: "Немає даних для аналітики",
    },

    analyticsBar: {
        showCategories: "Показати категорії",
        showChildCategories: "Показати дочірні категорії",
        loading: "Завантаження...",
        error: "Не вдалося завантажити аналітику",
        period: {
            daily: "По днях",
            monthly: "По місяцях",
            yearly: "По роках",
        },
        dateControl: {
            prev: {
                month: "Попередній місяць",
                year: "Попередній рік",
                years: "Попередні {0} роки",
            },
            next: {
                month: "Наступний місяць",
                year: "Наступний рік",
                years: "Наступні {0} роки",
            },
        },
    },
};
