export default {
    mainHeader: {
        loading: "Завантаження...",
        login: "Увійти",
        logout: "Вийти",
        register: "Зареєструватися",
        nav: {
            home: "Домашня",
        },
    },

    mainFooter: {
        desc: "Це футер",
    },

    mainLoader: "Завантаження...",

    form: {
        required: "Обов'язкове",
    },

    fetchErrors: {
        fetchError: "Сервер недоступний. Будь ласка, спробуйте пізніше",
        serverError: "Серверна помилка. Будь ласка, спробуйте пізніше. Якщо проблема не зникне, зверніться до адміністратора",
        unknownError: "Невідома помилка. Будь ласка, спробуйте пізніше. Якщо проблема не зникне, зверніться до адміністратора",
    },

    errorPages: {
        main: {
            header: "Помилка",
            desc: "Щось пішло не так. Будь ласка, спробуйте пізніше. Якщо проблема не зникне, зверніться до адміністратора.",
            link: "Перейти на домашню сторінку",
        },
        forbidden: {
            header: "Заборонено",
            desc: "У вас немає дозволу на доступ до цієї сторінки.",
            link: "Перейти на домашню сторінку",
        },
        notFound: {
            header: "Не знайдено",
            desc: "Сторінка, яку ви шукаєте, не існує.",
            link: "Перейти на домашню сторінку",
        },
    },

    homePage: {
        title: "Домашня сторінка",
    },

    loginPage: {
        title: "Вхід",
        resendVerificationEmail: "Повторно надіслати листа з підтвердженням",
        form: {
            fields: {
                username: "Електронна пошта",
                password: "Пароль",
            },
            errors: {
                username: {
                    required: "Електронна пошта обов'язкова",
                },
                password: {
                    required: "Пароль обов'язковий",
                },
            },
            submit: "Увійти",
            forgotPassword: "Забули пароль?",
            loading: "Вхід...",
        },
    },

    registerPage: {
        title: "Реєстрація",
        success: "Реєстрація успішна."
            + " Будь ласка, перевірте свою електронну пошту для підтвердження."
            + " Якщо ви не отримали листа, перевірте папку 'Спам'",
        form: {
            fields: {
                firstName: "Ім'я",
                lastName: "Прізвище",
                email: "Електронна пошта",
                password: "Пароль",
                matchingPassword: "Підтвердження пароля",
            },
            errors: {
                firstName: {
                    required: "Ім'я обов'язкове",
                },
                lastName: {
                    required: "Прізвище обов'язкове",
                },
                email: {
                    required: "Електронна пошта обов'язкова",
                },
                password: {
                    required: "Пароль обов'язковий",
                },
                matchingPassword: {
                    required: "Підтвердження пароля обов'язкове",
                },
            },
            submit: "Зареєструватися",
            loading: "Реєстрація...",
        },
    },

    resendVerificationEmailPage: {
        title: "Повторно надіслати листа з підтвердженням",
        success: "Листа з підтвердженням успішно надіслано."
            + " Будь ласка, перевірте свою електронну пошту."
            + " Якщо ви не отримали листа, перевірте папку 'Спам'",
        form: {
            fields: {
                email: "Електронна пошта",
            },
            errors: {
                email: {
                    required: "Електронна пошта обов'язкова",
                },
            },
            submit: "Надіслати",
            loading: "Надсилання...",
        },
    },

    resetPasswordPage: {
        title: "Скидання пароля",
        success: "Вам надіслано листа з посиланням для скидання пароля."
            + " Якщо лист не надійшов через декілька хвилин, перевірте папку 'Спам'",
        form: {
            fields: {
                email: "Електронна пошта",
            },
            errors: {
                email: {
                    required: "Електронна пошта обов'язкова",
                },
            },
            submit: "Надіслати",
            loading: "Надсилання...",
        },
    },

    resetPasswordSetPage: {
        title: "Встановлення нового пароля",
        success: "Ваш пароль успішно змінено",
        form: {
            fields: {
                newPassword: "Новий пароль",
                matchingPassword: "Підтвердження пароля",
            },
            errors: {
                newPassword: {
                    required: "Пароль обов'язковий",
                },
                matchingPassword: {
                    required: "Підтвердження пароля обов'язкове",
                },
            },
            submit: "Змінити пароль",
            loading: "Зміна пароля...",
        },
    },
};
